In [34]:
import pandas as pd 
sales=pd.read_csv('sales2.csv')
sales.head(5)

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2            E-Book Reader US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14

In [47]:
#useful ways to deal with strings

In [36]:
sales['Title'].str.lower().head(5)

0                                 NaN
1                 sales report for q4
2              e-book reader us store
3    pining for the fisheries of yore
4                            swimrand
Name: Title, dtype: object

In [37]:
sales['Title'].str.title().head(4)

0                                 NaN
1                 Sales Report For Q4
2              E-Book Reader Us Store
3    Pining For The Fisheries Of Yore
Name: Title, dtype: object

In [38]:
sales['Title'].str.len().head(4)

0     NaN
1    19.0
2    22.0
3    32.0
Name: Title, dtype: float64

In [39]:
sales.head(5)

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2            E-Book Reader US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14

In [40]:
sales['Title'].str.replace('Sales','Revenue').head(6)

0                                 NaN
1               Revenue report for Q4
2              E-Book Reader US Store
3    Pining for the Fisheries of Yore
4                            Swimrand
5              The Bricklayer's Bible
Name: Title, dtype: object

In [41]:
sales['Title'].str.contains('the').head(15)

0       NaN
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9       NaN
10      NaN
11    False
12    False
13     True
14    False
Name: Title, dtype: object

In [42]:
sales.head(10)

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2            E-Book Reader US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14
5            The Bricklayer's Bible        17.0        3.50     5.15
6                The Duck Goes Here        34.0        2.99     5.78
7       The Tower Commission Report         4.0        9.50     6.20
8                US royalties (USD)         NaN         NaN    32.25
9                               NaN         NaN         NaN      NaN

In [45]:
a=sales['Title'].fillna(method='bfill')

In [46]:
a.head(10)

0                 Sales report for Q4
1                 Sales report for Q4
2              E-Book Reader US Store
3    Pining for the Fisheries of Yore
4                            Swimrand
5              The Bricklayer's Bible
6                  The Duck Goes Here
7         The Tower Commission Report
8                  US royalties (USD)
9                 Sales report for Q4
Name: Title, dtype: object

In [44]:
sales.head(10)

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2            E-Book Reader US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14
5            The Bricklayer's Bible        17.0        3.50     5.15
6                The Duck Goes Here        34.0        2.99     5.78
7       The Tower Commission Report         4.0        9.50     6.20
8                US royalties (USD)         NaN         NaN    32.25
9                               NaN         NaN         NaN      NaN